answer_3/app/controllers/v1/area_controller.rb

    def index
      parent = Area.includes(:children).find_by(parent_id: nil)
---
SELECT  "areas".* FROM "areas" WHERE "areas"."parent_id" IS NULL LIMIT $1  [["LIMIT", 1]]